requests/request-create-claim.xml

<?xml version="1.0" encoding="utf-8"?>
<!-- WSDL: http://localhost:9080/insurance-health-component/ClaimsSoapService?wsdl -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://soap.insurance.example.com/">
  <soapenv:Header/>
  <soapenv:Body>
    <ns:createClaim>
      <policyNumber>POL123</policyNumber>
      <amount>2500.0</amount>
    </ns:createClaim>
  </soapenv:Body>
</soapenv:Envelope>
